Revit 2027 API
AnalysisDisplayStyle.HasMarkersAndTextSettings Method
 If true style has markers and text settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasMarkersAndTextSettings()
Public Function HasMarkersAndTextSettings As Boolean
public:
bool HasMarkersAndTextSettings()
member HasMarkersAndTextSettings : unit -> bool
Return Value
Boolean
See Also
Reference
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace